{
    "title" : "My Timeline",
    "experience" : [
        {
            "title" : "PayTM",
            "link" : "https://www.paytm.com/",
            "role" : "Senior Software Engineer",
            "duration" : "2022 - Present",
            "work" : [
                "Working in an agile environment in the central tech team under Paytm Promotions vertical.",
                "Migrated payment-gateway related storm topologies from 1.x cluster to 2.x cluster in staging and live production with zero downtime and zero lost updates."
            ]
        },
        {
            "title" : "Teradata",
            "link" : "https://www.teradata.com/",
            "role" : "Software Engineer",
            "duration" : "2021 - 2022",
            "work" : [
                "Achieved zero downtime server upgrades by developing a prototype of upgrade service for Teradata Viewpoint.",
                "Designed & developed a feature to alert the expiry of SSL certificates resulting in reduced fault tolerance in server security.",
                "Solved the problem of storing configuration passwords in clear text by engineering a secure vault service which solved almost 20+ security risks related to weak password storage mechanisms.",
                "Fixed 10k+ Viewpoint service from zero day vulnerability of log4jshell by implementing & releasing immediate patch.",
                "Collaborated with the security team for FIPS 140-2 compliance resulting in adaptation of Viewpoint by US federal services.",
                "Enabled JWT integration in DataMover portlet for SSO environments."
            ]
        },
        {
            "title" : "Wipro",
            "link" : "https://www.wipro.com/en-IN/",
            "role" : "Project Engineer",
            "duration" : "2019 - 2021",
            "work" : [
                "As part of UX-Next Team, worked on building the report renderer in IBM-TRIRIGA from scratch using React & Ag-Grid. IBM-TRIRIGA is used by Fortune-500 companies as Integrated Workplace Management System.",
                "Added central state management by implementing react-redux in the application code. Also, added support for React-Devtools reducing effective debug time that led to overall 40% increase in team productivity.",
                "Full-Stack Developer: Wrote and Reviewed code in Java, JavaScript (Spring/React). Also, implemented various RESTful APIs in Java/Spring that was consumed by the UI.",
                "Implemented filter operator ('In Range') for the back-end filter engine which reduces overall user search queries by 50%.",
                "Designed & developed a web component with features of session expiration warning & session renewal for SSO & Non-SSO environments hence reducing average session timeouts.",
                "Implemented XLS export for BIRT Reports in custom workflows.",
                "Improved lighthouse score from 74 to 93 for the platform by implementing web accessibility as per WCAG guidelines.",
                "Fixed various defects in the platform code to make it more stable."
            ]
        },
        {
            "title" : "AKTU",
            "link" : "https://aktu.ac.in/",
            "role" : "Undergraduate",
            "duration" : "2015 - 2019",
            "work" : [
                "Undergone Bachelor of Technology in Computer Science and scored 80% in the overall result."
            ]
        },
        {
            "title" : "RAMPUS",
            "link" : "http://rampus.co.in/",
            "role" : "Senior Secondary",
            "duration" : "2013 - 2015",
            "work" : [
                "Scored 75% with PCM as elective."
            ]
        }
    ]
}